In [1]:
import pandas as pd

# Crear un DataFrame con un dict

In [13]:
mis_datos = {
    "Nombres":["Luis", "Alfredo", "Mario"],
    "Edad":[12, 13, 17],
    "Genero":["M", "M", "M"]
}
pd.DataFrame(mis_datos)

   Nombres  Edad Genero
0     Luis    12      M
1  Alfredo    13      M
2    Mario    17      M

# Detectar valores nulos en un DataFrame:

In [14]:
# Creamos un DataFrame con algunos valores nulos
df = pd.DataFrame({'A': [1, 2, None, 4], 'B': [5, None, 7, 8]})

# Utilizamos la función isnull() para detectar los valores nulos
df.isnull()

       A      B
0  False  False
1  False   True
2   True  False
3  False  False

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
dtypes: float64(2)
memory usage: 192.0 bytes

In [19]:
df.count(axis=1)

0    2
1    1
2    1
3    2
dtype: int64

# Eliminar filas con valores nulos de un DataFrame

In [52]:
# Creamos un DataFrame con algunos valores nulos
df = pd.DataFrame({'A': [1, None, None, 4], 'B': [5, None, 7, 8], 'C':4*[None]})

# Utilizamos la función dropna() para eliminar las filas con valores nulos
df.dropna(how="all").dropna(axis=1, how="all")

     A    B
0  1.0  5.0
2  NaN  7.0
3  4.0  8.0

# Reemplazar valores nulos en un DataFrame

In [54]:
# Creamos un DataFrame con algunos valores nulos
df = pd.DataFrame({'A': [1, 2, None, 4], 'B': [5, None, 7, 8]})

# Utilizamos la función fillna() para reemplazar los valores nulos por cero
df["A"] = df["A"].fillna(0)
df["B"] = df["B"].fillna(-1)

In [55]:
df

     A    B
0  1.0  5.0
1  2.0 -1.0
2  0.0  7.0
3  4.0  8.0

# Interpolar valores nulos en un DataFrame

In [68]:
# Creamos un DataFrame con algunos valores nulos
df = pd.DataFrame({'A': [1, 2, None, 4], 'B': [5, None, 7, 8], 'C':[1.2, 4.5, None, 10.3], 'D':[1,2,3,4]})

# Utilizamos la función interpolate() para interpolar los valores nulos
df.interpolate()

     A    B     C  D
0  1.0  5.0   1.2  1
1  2.0  6.0   4.5  2
2  3.0  7.0   7.4  3
3  4.0  8.0  10.3  4

# Extra

In [72]:
df = pd.read_csv("db/NetFlix.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7787 entries, 0 to 7786
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       7787 non-null   object
 1   type          7787 non-null   object
 2   title         7787 non-null   object
 3   director      5398 non-null   object
 4   cast          7069 non-null   object
 5   country       7280 non-null   object
 6   date_added    7777 non-null   object
 7   release_year  7787 non-null   int64
 8   rating        7780 non-null   object
 9   duration      7787 non-null   int64
 10  genres        7787 non-null   object
 11  description   7787 non-null   object
dtypes: int64(2), object(10)
memory usage: 730.2+ KB

In [76]:
df[["director", "cast"]] = df[["director", "cast"]].fillna("No se encontro el dato")

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7787 entries, 0 to 7786
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       7787 non-null   object
 1   type          7787 non-null   object
 2   title         7787 non-null   object
 3   director      7787 non-null   object
 4   cast          7787 non-null   object
 5   country       7280 non-null   object
 6   date_added    7777 non-null   object
 7   release_year  7787 non-null   int64
 8   rating        7780 non-null   object
 9   duration      7787 non-null   int64
 10  genres        7787 non-null   object
 11  description   7787 non-null   object
dtypes: int64(2), object(10)
memory usage: 730.2+ KB

In [ ]:
# C:\Users\laalvarado\Documents\GitHub\INE_curso_pandas\db\BigmacPrice.csv

In [83]:
df = pd.read_csv("db/NetFlix.csv", dtype={"genres":"category"})
df = df.dropna().reset_index()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4808 entries, 0 to 4807
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   index         4808 non-null   int64
 1   show_id       4808 non-null   object
 2   type          4808 non-null   object
 3   title         4808 non-null   object
 4   director      4808 non-null   object
 5   cast          4808 non-null   object
 6   country       4808 non-null   object
 7   date_added    4808 non-null   object
 8   release_year  4808 non-null   int64
 9   rating        4808 non-null   object
 10  duration      4808 non-null   int64
 11  genres        4808 non-null   category
 12  description   4808 non-null   object
dtypes: category(1), int64(3), object(9)
memory usage: 480.3+ KB

In [80]:
df["rating"]

1       TV-MA
2       TV-PG
3           R
5           R
6       PG-13
        ...
7778    TV-MA
7781        R
7784    NC-17
7785    PG-13
7786    TV-MA
Name: rating, Length: 4808, dtype: object